quick_test.yml
---
services:
- module: passfail
  criteria:
  - subject: avg-rt  # required
    label: ''  # optional, default is ''
    condition: '>'  # required
    threshold: 50ms  # required
    timeframe: 1m 
    logic: for  # optional, logic to aggregate values within timeframe. 
                # Default 'for' means take latest, 
                # 'within' means take sum/avg of all values within interval
    fail: true  # optional, default is true
    stop: true  # optional, default is true

reporting:
- module: junit-xml
  data-source: pass-fail
- module: final_stats
  dump-csv: results.csv
scenarios:
  simple:
    requests:
    - https://qa-www.readytalk.com/ 

execution:
  concurrency: 10
  ramp-up: 30ms
  hold-for: 1m
  scenario: simple