site_test.yml
---
services:
- module: passfail
  criteria:
# ERROR TESTS
   - rc4??>0 for 1s, stop as failed
   - rc5??>0 for 1s, stop as failed
   - succ<100% for 1s, stop as failed
# RESPONSE TIME TESTS
   - avg-rt of low>10s for 10s, stop as failed
   - avg-rt of med>20s for 20s, stop as failed
   - avg-rt of high>30s for 30s, stop as failed

reporting:
# PRODUCED JUNIT RESULTS FOR JENKINS?
- module: junit-xml
  data-source: pass-fail
# WRITES RESULTS TO CSV
- module: final_stats
  data-source: pass-fail
  dump-csv: /results/results.csv

execution:
- concurrency: 5
  ramp-up: 1s
  hold-for: 60s
  scenario: low
- concurrency: 15
  ramp-up: 1s
  hold-for: 60s
  delay: 60s
  scenario: med
- concurrency: 25
  ramp-up: 1s
  hold-for: 60s
  delay: 2m
  scenario: high

scenarios:
  low:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: low
      url: https://qa-www.readytalk.com/
  med:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: med
      url: https://qa-www.readytalk.com/
  high:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: high
      url: https://qa-www.readytalk.com/