site_test.yml
---
services:
- module: passfail
  criteria:
# GENERIC TESTS
   - rc4??>0 for 1s, stop as failed
   - rc5??>0 for 1s, stop as failed
   - succ<100% for 1s, stop as failed
# BLOG TESTS
   - avg-rt of BlogLow>10s for 10s, stop as failed
   - avg-rt of BlogMed>20s for 20s, stop as failed
   - avg-rt of BlogHigh>30s for 30s, stop as failed
# WEBSITE TESTS
#   - avg-rt of Website>10s for 5s, stop as failed

reporting:
# PRODUCED JUNIT RESULTS FOR JENKINS?
- module: junit-xml
  data-source: pass-fail
# WRITES RESULTS TO CSV
- module: final_stats
  data-source: pass-fail
  dump-csv: results.csv

execution:
#-  concurrency: 5
#   ramp-up: 1s
#   hold-for: 30s
#   scenario: Website
- concurrency: 5
  ramp-up: 1s
  hold-for: 10s
  scenario: BlogLow
- concurrency: 15
  ramp-up: 1s
  hold-for: 20s
  delay: 35s
  scenario: BlogMed
- concurrency: 25
  ramp-up: 1s
  hold-for: 30s
  delay: 60s
  scenario: BlogHigh

scenarios:
  Website:
    timeout: 30s
    requests:
    - label: Website
      url: https://qa-www.readytalk.com/
  BlogLow:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: BlogLow
      url: https://blog.blue.iwa.ecovate.com/
  BlogMed:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: BlogMed
      url: https://blog.blue.iwa.ecovate.com/
  BlogHigh:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: BlogHigh
      url: https://blog.blue.iwa.ecovate.com/