site_test.yml
---
services:
- module: passfail
  criteria:
# ERROR TESTS
   - rc4??>0 for 1s, stop as failed
   - rc5??>0 for 1s, stop as failed
   - succ<100% for 1s, stop as failed
# RESPONSE TIME TESTS
   - avg-rt of load>10s for 10s, stop as failed

reporting:
# PRODUCED JUNIT RESULTS FOR JENKINS?
- module: junit-xml
  data-source: pass-fail
# WRITES RESULTS TO CSV
- module: final_stats
  data-source: pass-fail
  dump-csv: /results/results.csv

execution:
- concurrency: 5
  ramp-up: 1s
  hold-for: 60s
  scenario: load

scenarios:
  load:
    timeout: 30s
    retrieve-resources: false
    requests:
    - label: low
      url: https://qa-www.readytalk.com/