site_test.yml
---
services:
- module: passfail
  criteria:
  - rc4??>0 for 1s, stop as failed
  - rc5??>0 for 1s, stop as failed
  - subject: avg-rt  # required
    label: ''  # optional, default is ''
    condition: '>'  # required
    threshold: 50ms  # required
    timeframe: 30s 
    logic: for  # optional, logic to aggregate values within timeframe. 
                # Default 'for' means take latest, 
                # 'within' means take sum/avg of all values within interval
    fail: true  # optional, default is true
    stop: true  # optional, default is true


reporting:
- module: junit-xml
  data-source: pass-fail
- module: final_stats
  dump-csv: results.csv

execution:
- concurrency: 5
  ramp-up: 30ms
  hold-for: 30s
  scenario: simple

scenarios:
  simple:
    requests:
    - url: https://blog.blue.wwwtst.ecovate.com/
    - url: https://qa-www.readytalk.com/