site_test.yml
---
services:
- module: passfail
  criteria:
  - rc4??>0 for 1s, stop as failed
  - rc5??>0 for 1s, stop as failed
  - avg-rt of Website>50ms for 30s, stop as failed
  - avg-rt of Blog>50ms for 30s, stop as failed
  - succ<100% for 1s, stop as failed


reporting:
- module: junit-xml
  data-source: pass-fail
- module: final_stats
  dump-csv: results.csv

execution:
- concurrency: 1
  ramp-up: 30ms
  hold-for: 30s
  scenario: Blog
- concurrency: 5
  ramp-up: 30ms
  hold-for: 1m
  scenario: Website

scenarios:
  Website:
    timeout: 30s
    requests:
    - label: Website
      url: https://qa-www.readytalk.com/
  Blog:
    timeout: 30s
    requests:
    - label: Blog
      url: https://blog.blue.wwwtst.ecovate.com/